"""Дату 2 жовтня 2020 р. будемо називати «магічною», оскільки, коли
вона записана у форматі 02.10.20, добуток значень дня і місяця
дорівнюють значенню року. Напишіть програму, яка запропонує
користувачеві ввести день, місяць і рік (лише останні дві цифри) у
числовій формі. Програмі слід вивести повідомлення про те, що
введена дата є «магічною». В іншому випадку має бути повідомлення,
що це звичайна дата.
"""
#Створення зміних типу ціле число для зміних з назвами day, month, year.
day = int(input("Enter day: "))
month = int(input("Enter month: "))
year = int(input("Enter year: "))
#Перевірка на відповідність виконання умов задачі. Та виведення резултатів в консоль.
if day * month == year:
    print("Це магічна дата")
else:
    print("Це звичайна дата.")