"""Дано натуральне число n (0 ≤ n ≤ 1000), яке визначає період
піврозпаду радіоактивних атомів, визначений у роках. Необхідно
вивести значення періоду піврозпаду, додавши до цього числа
відповідно «рік» (rik), «роки» (roky), «років» (rokiv).
"""
#Створення зміної цілого типу для збереження значення року
Year = int(input("Введіть рік: "))
#Створення коротшої змінної, що приймає значення зміної Year
y = Year
#Початок розгалуження, перевірка на відповідність умов та виведення результату
if y % 10 == 1 and y % 100 != 11 and y != 11 or y % 100 == 1 and y % 100 != 11:
    print(y, " rik")
#Продовження розгалуження, перевірка на відповідність умов та виведення результату
elif 1 < y % 100 < 5 or 1 < y % 10 < 5 and y % 100 > 14:
    print(y, " roki")
#Закінчення розгалуження, перевірка на відповідність відмінної від попередніх умов.
else:
    print(y, " rokiv")